bustrack/app/views/welcomes/index.html.erb

<datalist id="fromresults">
<% Parada.all.each do |parada| %>
---
SELECT "paradas".* FROM "paradas"