bustrack/app/views/mapas/index.html.erb

		/*var places = [];
		  	< Parada.all.each do |parada| >
---
SELECT "paradas".* FROM "paradas"