bustrack/app/controllers/authentications_controller.rb

SELECT  "authentications".* FROM "authentications"  WHERE "authentications"."provider" = 'facebook' AND "authentications"."uid" = '10152186119160784' LIMIT 1
INSERT INTO "authentications" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-06-29 04:11:18.061083"], ["provider", "facebook"], ["uid", "10152186119160784"], ["updated_at", "2014-06-29 04:11:18.061083"], ["user_id", 1]]
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-06-29 04:11:18.010443"], ["email", "luiscarlos.mateo@gmail.com"], ["updated_at", "2014-06-29 04:11:18.010443"]]
---
  def create
    omniauth = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
    if authentication
      flash[:notice] = "Signed in Successfully"
      sign_in_and_redirect(:user, authentication.user)
    elsif current_user
      current_user.authentications.create!(:provider => omniauth['provider'], :uid => omniauth['uid'])