bustrack/app/controllers/mapas_controller.rb

  def index
    @mapas = Mapa.all
		@paradas = Parada.all
---
SELECT "mapas".* FROM "mapas"
SELECT "paradas".* FROM "paradas"

  def create
    @mapa = Mapa.new(mapa_params)

    respond_to do |format|
      if @mapa.save
---
INSERT INTO "mapas" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-06-29 04:37:54.178596"], ["updated_at", "2014-06-29 04:37:54.178596"]]

    def set_mapa
      @mapa = Mapa.find(params[:id])
---
SELECT  "mapas".* FROM "mapas"  WHERE "mapas"."id" = ? LIMIT 1  [["id", 1]]