bustrack/app/controllers/rutas_usuarios_controller.rb

SELECT "rutas_usuarios".* FROM "rutas_usuarios"
---
  def index
    @rutas_usuarios = RutasUsuario.all