bustrack/app/controllers/rutas_controller.rb

SELECT "rutas".* FROM "rutas"
---
  def index
    @rutas = Ruta.all