bustrack/app/controllers/welcomes_controller.rb

  def index
    @welcomes = Welcome.all
    @paradas = Parada.all
---
SELECT "welcomes".* FROM "welcomes"
SELECT "paradas".* FROM "paradas"