bustrack/app/views/rutas/index.html.erb

        <% @inicial = nil%>
        <% ruta.ruta_parada.each do |ruta_parada| %>
---
SELECT "ruta_paradas".* FROM "ruta_paradas"  WHERE "ruta_paradas"."ruta_id" = ?  [["ruta_id", 1]]
SELECT "rutas".* FROM "rutas"